desSLM = SLM\u53ef\u4ee5\u7528\u6765\u8c03\u5236\u5149\u632f\u5e45\u53ca\u76f8\u4f4d\uff0c\u5176\u5185\u90e8\u7ed3\u6784\u5982\u540c\u4e00\u822c\u7684\u6db2\u6676\u663e\u793a\u5668\uff0c\u662f\u7531\u8bb8\u591a\u683c\u72b6\u7684\u50cf\u7d20\u6240\u7ec4\u6210\u7684\u77e9\u9635\u7ed3\u6784\u3002\u5f53\u65bd\u52a0\u7535\u538b\u65f6\u6bcf\u4e00\u4e2a\u50cf\u7d20\u4e0a\u7684\u6db2\u6676\u4f1a\u4f9d\u7535\u538b\u5927\u5c0f\u800c\u6709\u4e0d\u540c\u89d2\u5ea6\u7684\u504f\u8f6c\uff0c\u8fdb\u800c\u9020\u6210\u4e0d\u540c\u7684\u6298\u5c04\u7387\u800c\u8fbe\u5230\u8c03\u5236\u7684\u6548\u679c\u3002\u5728\u672a\u7ed9\u4e88\u7535\u8baf\u53f7\u7684\u60c5\u5f62\u4e0bSLM\u57fa\u672c\u7684\u7ed3\u6784\u5c31\u4f1a\u5f71\u54cd\u5230\u5149\u7684\u8868\u73b0\uff0c\u5305\u62ec\u6700\u5927\u7ed5\u5c04\u89d2\u5ea6\u3001\u7ed5\u5c04\u6548\u7387\u3001\u53ca\u504f\u632f\u6001\u7684\u53d8\u5316\uff0c\u5229\u7528\u8fd9\u4e9b\u7279\u6027\u6211\u4eec\u4fbf\u80fd\u63a8\u7b97\u51faSLM\u5404\u9879\u57fa\u672c\u53c2\u6570\uff0c\u5982\uff1a\u50cf\u7d20\u5927\u5c0f\u3001\u5f00\u53e3\u7387\u3001\u53ca\u914d\u5411\u89d2\u5ea6\u3002
desAmplitude = \u7a7a\u95f4\u5149\u8c03\u5236\u5668\u914d\u5408\u504f\u632f\u7247\u4e0e\u68c0\u504f\u7247\u7684\u89d2\u5ea6\u8c03\u6574\u80fd\u4f7f\u7a7a\u95f4\u5149\u8c03\u5236\u5668\u53d8\u6210\u632f\u5e45\u8c03\u5236\u5668\u662f\u76f8\u4f4d\u8c03\u5236\u5668\u3002\u7531\u524d\u9762\u6240\u8ba1\u7b97\u51fa\u7684\u7a7a\u95f4\u5149\u8c03\u5236\u5668\u7a7f\u900f\u7387\u53ef\u77e5\u5f53\u504f\u632f\u7247\u4e0e\u68c0\u504f\u7247\u5939\u89d2\u4e3a\u96f6\u5ea6\u4e14\u504f\u632f\u7247\u4e0e\u914d\u5411\u89d2\u540c\u65b9\u5411\u65f6\u4f1a\u6709\u6700\u5927\u7684\u632f\u5e45\u7a7f\u900f\u7387\uff0c\u6211\u4eec\u5c31\u4f9d\u6b64\u7279\u6027\u6765\u627e\u51fa\u7a7a\u95f4\u5149\u8c03\u5236\u5668\u7684\u914d\u5411\u89d2\u3002\u627e\u51fa\u7a7a\u95f4\u5149\u8c03\u5236\u5668\u7684\u914d\u5411\u89d2\u4e4b\u540e\uff0c\u63a5\u4e0b\u6765\u4f7f\u504f\u632f\u7247\u4e0e\u914d\u5411\u8f74\u5939\u89d2\u4e3a\u56db\u5341\u4e94\u5ea6\u3001\u4e0e\u68c0\u504f\u7247\u5939\u89d2\u4e3a\u4e5d\u5341\u5ea6\u7684\u8bbe\u5b9a\u5f97\u5230\u7a7f\u900f\u7387\u4ee5\u6b63\u5f26\u5e73\u65b9\u7684\u5f62\u5f0f\u53d8\u5316\u9020\u6210\u4e0d\u540c\u7684\u7070\u9636\u6548\u679c\u3002\u5e76\u4e8e\u540e\u65b9\u52a0\u5165\u4e00\u9762\u900f\u955c\uff0c\u4ee5\u9020\u955c\u8005\u516c\u5f0f\u5f97\u77e5\u5176\u7269\u8ddd\u3001\u50cf\u8ddd\u53ca\u653e\u5927\u7387\u6765\u5236\u4f5c\u51fa\u7b80\u6613\u7684\u6295\u5f71\u7cfb\u7edf\u3002
desPhaseModulation = \u5728\u5b9e\u9a8c\u4e8c\u91cc\u6211\u4eec\u8c03\u6574\u504f\u632f\u7247\u4e0e\u68c0\u504f\u7247\uff0c\u4f7f\u5f97\u7a7a\u95f4\u5149\u8c03\u5236\u5668\u53d8\u6210\u632f\u5e45\u8c03\u5236\u5668\uff0c\u5e76\u914d\u5408\u900f\u955c\u5f62\u6210\u4e00\u4e2a\u7b80\u6613\u7684\u6295\u5f71\u7cfb\u7edf\u3002\u5728\u8fd9\u8282\u6211\u4eec\u5c06\u518d\u6b21\u8c03\u6574\u504f\u632f\u7247\u53ca\u68c0\u504f\u7247\uff0c\u4f7f\u5176\u53d8\u4e3a\u76f8\u4f4d\u8c03\u5236\u5668\u3002\u5f53\u504f\u632f\u7247\u3001\u68c0\u504f\u7247\u548c\u914d\u5411\u89d2\u4e3a\u540c\u5411\u65f6\u53ef\u5f97\u5230\u6700\u5927\u7684\u7a7f\u900f\u7387T = 1\uff0c\u4e5f\u5c31\u662f\u8bf4\u4e0d\u7ba1\u6db2\u6676\u5206\u5b50\u5982\u4f55\u8f6c\u52a8\u5c06\u4e0d\u5f71\u54cd\u51fa\u5c04\u5149\u7684\u5f3a\u5ea6\u53ea\u4f1a\u9020\u6210\u76f8\u4f4d\u5dee\u3002\u63a5\u7740\u6211\u4eec\u5229\u7528\u503e\u659c\u5f0f\u5149\u6805(Blazed Grating)\u8ba9\u76f8\u4f4d\u8c03\u5236\u5668\u505a\u7b80\u5355\u7684\u5149\u675f\u63a7\u5236(Beam Steering)\u5b9e\u9a8c\u6765\u4e86\u89e3\u7ed5\u5c04\u89d2\u5ea6\u7684\u6781\u9650\u3002
desMichelson = \u5e72\u6d89\u7684\u73b0\u8c61\u662f\u7531\uf978\u4e2a\u6216\u4e24\u4e2a\u4ee5\u4e0a\u7684\u5149\u6ce2\u8fed\u52a0\u4e8e\u7a7a\u95f4\u4e4b\u4e2d\u800c\u4ea7\u751f\u3002\u7531\u5149\u7a0b\u5dee\u6240\u9020\u6210\u7684\u76f8\u4f4d\u5dee\u800c\u4ea7\u751f\uf977\u7eb9\uff08\u5efa\u8bbe\u6027\u5e72\u6d89\uff09\u4e0e\u6697\u7eb9\uff08\u7834\u574f\u6027\u5e72\u6d89\uff09\u7b49\u5e72\u6d89\u6761\u7eb9\u3002\u8981\u89c2\u5bdf\u5230\u5e72\u6d89\u6761\u7eb9\u9664\u4e86\u9700\u8981\u4e0a\u8ff0\u7684\u76f8\u4f4d\u5dee\u6240\u9020\u6210\u7684\u5efa\u8bbe\u6027\u5e72\u6d89\u4e0e\u7834\u574f\u6027\u5e72\u6d89\u4e4b\u5916\uff0c\u8fd8\u9700\u8981\u6ce8\u610f\u5149\u6ce2\u504f\u632f\u65b9\u5411\u4e0e\u76f8\u5e72\u6027\uff08coherence\uff09\uff0c\u7b80\u800c\u8a00\u4e4b\uff0c\uf978\u4e2a\u6709\u76f8\u540c\u504f\u632f\u7684\u5149\u6ce2\u5230\u8fbe\u5c4f\u5e55\u7684\u5149\u7a0b\u5dee\u8d8a\u63a5\u8fd1\u7684\u8bdd\uff0c\u5e72\u6d89\u6761\u7eb9\u7684\u5bf9\u6bd4\u4e5f\u4f1a\u8d8a\u597d\u3002\n\u672c\u5b9e\u9a8c\u4e2d\u7684\u5e72\u6d89\u4eea\u5229\u7528\u4e86\u5206\u5149\u955c\u5c06\u5165\u5c04\u7684\u96f7\u5c04\u5149\u5206\u6210\u4e24\u9053\u5149\uff0c\u4e00\u9053\u7a7f\u900f\u5149\u4e0e\u4e00\u9053\u53cd\u5c04\u5149\uff0c\u8fd9\u79cd\u5206\u5149\u7684\u539f\u7406\u88ab\u5206\u7c7b\u4e3a\u632f\u5e45\u5206\u5149(division of amplitude)\u548c\u6768\u683c\u53cc\u72ed\u7f1d\u5e72\u6d89\u4e2d\u5229\u7528\u76f8\u90bb\u7684\u4e24\u6761\u72ed\u7f1d\u628a\u540c\u4e00\u9053\u6ce2\u524d\u5206\u6210\u4e24\u9053\u65b0\u7684\u5149\u6e90\u7684\u6ce2\u524d\u5206\u5149(division of wave front)\u4e0d\u540c\u3002\u63a5\u7740\u7531\u5206\u5149\u6240\u5206\u51fa\u7684\u7a7f\u900f\u5149\u7ecf\u7531\u76f8\u4f4d\u8c03\u5236\u5668\u4ea7\u751f\u5404\u79cd\u6ce2\u524d\u4e0e\u53cd\u5c04\u5149\u7ecf\u7531\u9762\u955c\u53cd\u5c04\u56de\u6765\u5728\u7a7a\u95f4\u4e2d\u4ea4\u4f1a\u4ea7\u751f\u5e72\u6d89\uff0c\u5e76\u80fd\u5728\u5c4f\u5e55\u4e0a\u89c2\u5bdf\u5230\u5e72\u6d89\u56fe\u5f62\u3002
desDiffaction = \u5149\u7684\u6ce2\u52a8\u6027\u8d28\u53ef\u4ee5\u5f88\u5bb9\u6613\u5730\u4ece\u5e72\u6d89\u4e0e\u7ed5\u5c04\u7684\u73b0\u8c61\u4e2d\u89c2\u5bdf\u5230\uff0c\u8981\u89e3\u91ca\u5176\u539f\u56e0\u5f97\u5148\u4eceHuygens-Fresnel\u539f\u7406\u8bf4\u8d77\uff0c\u5176\u5185\u5bb9\u4e3a\u6ce2\u524d\u4e0a\u6bcf\u4e00\u70b9\u90fd\u53ef\u89c6\u4e3a\u65b0\u7684\u70b9\u6ce2\u6e90\u5404\u81ea\u53d1\u51fa\u6b21\u7ea7\u7403\u9762\u6ce2\uff0c\u6ce2\u524d\u7684\u65b0\u4f4d\u7f6e\u5219\u662f\u8fd9\u4e9b\u7403\u9762\u7684\u5305\u7edc\u9762\u3002\u56e0\u6b64\u5728\u5355\u72ed\u7f1d\u7ed5\u5c04\u5b9e\u9a8c\u4e2d\uff0c\u5e73\u9762\u6ce2\u9047\u4e0a\u72ed\u7f1d\u540e\uff0c\u72ed\u7f1d\u4e0a\u7684\u6bcf\u4e00\u70b9\u90fd\u89c6\u4e3a\u65b0\u7684\u70b9\u5149\u6e90\u5728\u5404\u65b9\u5411\u53d1\u51fa\u5149\u6ce2\uff0c\u76f4\u8fdb\u7684\u975e\u7ed5\u5c04\u5149\u5728\u8fdc\u5904\u4ee5\u76f8\u540c\u7684\u76f8\u4f4d\u5230\u8fbe\u5c4f\u5e55\u5f62\u6210\u4eae\u70b9\u3002\u73b0\u5728\u6709\u53e6\u4e00\u675f\u5149\u4ee5\u4e0e\u6c34\u5e73\u5939\u89d2\u03b8\u7684\u65b9\u5411\u884c\u8fdb\uff0c\u5f53\u5149\u675f\u6700\u4e0a\u5c42\u4e0e\u6700\u4e0b\u5c42\u7684\u5149\u7a0b\u5dee\u521a\u597d\u4e3a\u4e00\u4e2a\u6ce2\u957f\u65f6\uff0c\u6b63\u4e2d\u95f4\u7684\u5149\u675f\u4f1a\u4e0e\u6700\u4e0a\u9762\u7684\u5149\u675f\u76f8\u5dee\u4e86\u534a\u4e2a\u6ce2\u957f(\u76f8\u4f4d\u76f8\u5dee\u03c0)\u800c\u76f8\u6d88\uff0c\u63a5\u7740\u5f80\u4e0b\u63a8\u4e0b\u53bb\u6574\u675f\u5149\u90fd\u4f1a\u76f8\u5dee\u534a\u6ce2\u957f\u800c\u76f8\u6d88\u6389\uff0c\u6700\u540e\u5728\u5c4f\u5e55\u4e0a\u663e\u793a\u6697\u7eb9\u3002\u4f9d\u76f8\u540c\u7684\u539f\u7406\u53ef\u63a8\u5f97\u5f53\u5149\u7a0b\u5dee\u4e3a\u6ce2\u957f\u6574\u6570\u500d\u65f6\u5373\u4f1a\u4ea7\u751f\u6697\u7eb9\u3002\n\u6768\u683c\u7684\u53cc\u72ed\u7f1d\u5b9e\u9a8c\u4e3a\u6ce2\u524d\u5206\u5149\u7684\u5e72\u6d89\u4eea\uff0c\u539f\u6ce2\u524d\u88ab\u4e24\u6761\u72ed\u7f1d\u6321\u4f4f\u53ea\u7559\u4e0b\u901a\u8fc7\u72ed\u7f1d\u7684\u90e8\u4efd\uff0c\u901a\u8fc7\u72ed\u7f1d\u7684\u5149\u88ab\u89c6\u4e3a\u65b0\u7684\u70b9\u6ce2\u6e90\u5728\u8fdc\u5904\u5c4f\u5e55\u4e0a\u5f62\u6210\u5e72\u6d89\u6761\u7eb9\uff0c\u4e24\u4e2a\u70b9\u6ce2\u6e90\u4f1a\u5f80\u56db\u9762\u516b\u65b9\u6563\u51fa\u5149\u7ebf\uff0c\u5f53\u5c04\u51fa\u5149\u7ebf\u4e0e\u6c34\u5e73\u5939\u89d2\u4e3a\u03c6\uff0c\u5149\u7a0b\u5dee\u4e3a\u4e00\u4e2a\u6ce2\u957f\u65f6\uff0c\u4e24\u675f\u4e3a\u5efa\u8bbe\u6027\u5e72\u6d89\uff0c\u6700\u540e\u5728\u8fdc\u5904\u5c4f\u5e55\u5f62\u6210\u4eae\u7eb9\u3002\u6b64\u7ed3\u679c\u4e0e\u5355\u72ed\u7f1d\u4e0d\u540c\uff0c\u540c\u6837\u5728\u6700\u4e0a\u65b9\u4e0e\u6700\u4e0b\u65b9\u7684\u5149\u6e90\u5904\u76f8\u5dee\u6574\u6570\u500d\u6ce2\u957f\uff0c\u4f46\u4ea7\u751f\u7684\u7ed3\u679c\u4e3a\u4e00\u4e2a\u6697\u7eb9\u4e00\u4e2a\u4eae\u7eb9\uff0c\u81f3\u4e8e\u53cc\u72ed\u7f1d\u7684\u6697\u7eb9\u5219\u4f1a\u5728\u5149\u7a0b\u5dee\u7b49\u4e8e\u534a\u6ce2\u957f\u9020\u6210\u7834\u574f\u6027\u5e72\u6d89\u65f6\u4ea7\u751f\u3002
desSpectrometer = \u5149\u8c31\u4eea\u5e38\u88ab\u5e94\u7528\u4e8e\u5404\u79cd\u6750\u6599\u7684\u5149\u7279\u6027\u5206\u6790\u4e0a\uff0c\u8fd9\u662f\u7531\u4e8e\u5149\u8c31\u4eea\u53ef\u4ee5\u5206\u6790\u5149\u8c31\u5e76\u91cf\u6d4b\u5404\u6ce2\u957f\u7684\u5f3a\u5ea6\u5206\u5e03\u3002\u5176\u539f\u7406\u4e3a\u5229\u7528\u4e0d\u540c\u9891\u7387\u7684\u5149\u5bf9\u540c\u4e00\u5468\u671f\u6027\u5149\u6805\u4f1a\u6709\u4e0d\u540c\u7684\u7ed5\u5c04\u89d2\u5ea6\uff0c\u5047\u8bbe\u5149\u6805\u5468\u671f\u4e3ad\u3001\u6ce2\u957f\u4e3a\u03bb\u3001\u7ed5\u5c04\u89d2\u5ea6\u4e3a\u03b8\uff0c\u5f53\u5468\u671f\u6027\u7684\u5149\u6805\u4e0e\u6ce2\u957f\u5173\u7cfb\u5982\u4e0b\u65f6 \n dsin\u03b8m = m\u03bb \n\u5176\u4e2dm\u4e3a\u7ed5\u5c04\u9636\u6570\uff0c\u6b64\u65f6\u4e0e\u539f\u5149\u8def\u5939 \u03b8m \u7684\u65b9\u5411\u4fbf\u6709\u7ed5\u5c04\u5149\u4ea7\u751f\u3002\u968f\u7740\u6ce2\u957f\u7684\u4e0d\u540c\u6240\u9020\u6210\u7684\u7ed5\u5c04\u89d2\u5ea6\u4e5f\u4e0d\u540c\uff0c\u7ed3\u679c\u5982\u4e0b\u56fe\uff0c\u68c0\u6d4b\u5149\u5165\u5c04\u81f3\u5149\u6805\u91cc\u53d7\u5468\u671f\u6027\u5149\u6805\u7684\u5f71\u54cd\u4e0d\u540c\u6ce2\u957f\u7684\u5149\u7ed5\u5c04\u81f3\u4e0d\u540c\u65b9\u5411\uff0c\u7ea2\u8272\u7531\u4e8e\u6ce2\u957f\u8f83\u957f\u6240\u4ee5\u89d2\u5ea6\u4e5f\u4f1a\u8ddf\u7740\u53d8\u5927\uff0c\u84dd\u8272\u7531\u4e8e\u6ce2\u957f\u8f83\u77ed\u6240\u4ee5\u89d2\u5ea6\u4f1a\u6bd4\u8f83\u63a5\u8fd1\u539f\u53cd\u5c04\u8def\u7ebf\uff0c\u63a5\u7740\u7531\u900f\u955c\u5c06\u4e0d\u540c\u6ce2\u957f\u7684\u5149\u805a\u7126\u5728\u7126\u5e73\u9762\u4e0a\uff0c\u5e76\u91cf\u6d4b\u5404\u6ce2\u6bb5\u4f4d\u7f6e\u3001\u89d2\u5ea6\u6765\u63a8\u7b97\u5176\u6ce2\u957f\u3002
desSignalProcessing = 4f\u7cfb\u7edf\u4e3a\u5149\u5b66\u4e0a\u5e38\u89c1\u7684\u8baf\u53f7\u5904\u7406\u7cfb\u7edf\uff0c\u4e3b\u8981\u7684\u7ec4\u4ef6\u7531\u4e24\u7ec4\u900f\u955c\u53ca\u6ee4\u6ce2\u5668\u7ec4\u6210\uff0c\u8f93\u5165\u7684\u8baf\u53f7\u7f6e\u4e8e\u7b2c\u4e00\u9762\u900f\u955c\u7684\u524d\u7126\u9762\u4e0a\u5c06\u8f93\u5165\u7684\u6570\u636e\u505a\u5085\u6c0f\u8f6c\u5c06\u5e73\u8c31\u4ea7\u751f\u5728\u540e\u7126\u9762\u4e0a\uff0c\u800c\u5728\u7b2c\u4e00\u9762\u900f\u955c\u7684\u540e\u7126\u9762\u4e0a\u7f6e\u5165\u6ee4\u6ce2\u5668\u8fdb\u884c\u6ee4\u6ce2\uff0c\u5e76\u5728\u540e\u65b9\u7f6e\u5165\u7b2c\u4e8c\u9762\u900f\u955c\u4e14\u8ddd\u79bb\u521a\u597d\u4e3a\u7b2c\u4e8c\u9762\u900f\u955c\u7684\u7126\u8ddd\u518d\u505a\u4e00\u6b21\u5085\u6c0f\u8f6c\u6362\uff0c\u6700\u540e\u5728\u7b2c\u4e8c\u9762\u900f\u955c\u7684\u540e\u7126\u9762\u4e0a\u53ef\u5f97\u6ee4\u6ce2\u540e\u6240\u5f97\u7ed3\u679c\u3002\u8fdb\u884c\u6ee4\u6ce2\u65f6\u5c31\u5728\u9891\u8c31\u9762\u906e\u6321\u4e0d\u8981\u7684\u9891\u7387\uff0c\u6321\u4f4f\u9ad8\u9891\u3001\u4f4e\u9891\u3001x\u65b9\u5411\u7684\u9891\u7387\u3001y\u65b9\u5411\u7684\u9891\u7387\uff0c\u6700\u540e\u5728\u6210\u50cf\u9762\u4e0a\u5f97\u5230\u5404\u79cd\u4e0d\u540c\u7684\u53d8\u5316\u3002
desPhaseRetarder = \u76f8\u79fb\u5f0f\u6570\u5b57\u5168\u50cf\u672f\u4ee5\u5149\u7684\u5e72\u6d89\u539f\u7406\u4e3a\u57fa\u7840\uff0c\u6539\u53d8\u7269\u5149\u53ca\u53c2\u8003\u5149\u7684\u76f8\u5bf9\u76f8\u4f4d\uff0c\u901a\u5e38\u662f\u5229\u7528\u538b\u7535\u6750\u6599\u6539\u53d8\u53c2\u8003\u5149\u7684\u5149\u7a0b\u6765\u9020\u6210\u76f8\u4f4d\u5dee\u4f7f\u5e72\u6d89\u6761\u7eb9\u5206\u5e03\u6539\u53d8\uff0c\u91cd\u590d\u6570\u6b21\u540e\u5f97\u5230\u591a\u5f20\u4e0d\u540c\u5e72\u6d89\u6761\u7eb9\uff0c\u518d\u7ecf\u7531\u8fd9\u4e9b\u5e72\u6d89\u56fe\u5f62\u7684\u5149\u5f3a\u5206\u5e03\u53d8\u5316\u6c42\u5f97\u539f\u7269\u6ce2\u7684\u76f8\u4f4d\u5206\u5e03\u3002\u5f97\u5230\u4e86\u7269\u6ce2\u7684\u5149\u5f3a\u53ca\u76f8\u4f4d\uff0c\u6211\u4eec\u5373\u80fd\u5229\u7528\u8fd1\u573a\u7ed5\u5c04\u7406\u8bba\u56de\u63a8\u51fa\u539f\u4f53\u3002
desTalbot = \u7ed5\u5c04\u7406\u8bba\u4e2d\u7684\u8fd1\u573a\u7ed5\u5c04\u7406\u8bba(Fresnel Diffraction)\u6709\u7740\u76f8\u5f53\u590d\u6742\u7684\u79ef\u5206\u516c\u5f0f\uff0c\u4e00\u822c\u79ef\u5206\u7684\u7ed3\u679c\u53ef\u7531\u65b9\u5b54\u7ed5\u5c04\u770b\u51fa\u662f\u76f8\u5f53\u5e9e\u5927\u4e14\u590d\u6742\uff0c\u4f46\u5468\u671f\u6027\u5149\u6805\u7684\u7ed5\u5c04\u5374\u6709\u8f83\u7b80\u5355\u7684\u7ed3\u679c\u53ca\u7279\u6b8a\u7684\u81ea\u6210\u50cf\u73b0\u8c61\u53d1\u751f\u3002Talbot Images\u4e3a\u5468\u671f\u6027\u5149\u6805\u5728\u8fd1\u573a\u7ed5\u5c04\u65f6\u6240\u4ea7\u751f\u7684\u81ea\u6210\u50cf\uff0c\u5176\u4ea7\u751f\u7684\u4f4d\u7f6e\u4e0e\u5149\u6805\u5468\u671f\u5e73\u65b9\u6210\u6b63\u6bd4\uff0c\u6ce2\u957f\u6210\u53cd\u6bd4\uff0c\u5e76\u5728\u5176\u6574\u6570\u500d\u7684\u8ddd\u79bb\u4e0a\u4f1a\u4e00\u76f4\u770b\u5230\u81ea\u6210\u50cf\uff0c\u800c\u5728\u8fd9\u4e9b\u6210\u50cf\u7684\u4e2d\u95f4\u8fd8\u80fd\u89c2\u5bdf\u5230\u4e0e\u539f\u5f71\u50cf\u5bf9\u6bd4\u76f8\u53cd\u7684\u81ea\u6210\u50cf\uff0c\u5b9e\u9a8c\u4e2d\u7531SLM\u4ea7\u751f\u5468\u671f\u6027\u5149\u6805\uff0c\u5e76\u7531CCD\u62cd\u6444\u6240\u4ea7\u751f\u7684\u81ea\u6210\u50cf\uff0c\u6539\u53d8CCD\u7684\u4f4d\u7f6e\u89c2\u5bdf\u5f71\u50cf\u53d8\u5316\u53ca\u4f4d\u7f6e\u3002
desWavefront = SLM (Spatial Light Modulator) \u80fd\u63a5\u53d7\u7535\u5b50\u8baf\u53f7\u6765\u6539\u53d8\u5149\u8baf\u53f7\uff0c\u7535\u5b50\u8baf\u53f7\u4f7f\u6db2\u6676\u5206\u5b50\u6392\u5217\u65b9\u5411\u504f\u8f6c\u6539\u53d8\u6db2\u6676\u7684\u6298\u5c04\u7387\uff0c\u4f7f\u5f97\u901a\u8fc7SLM\u7684\u5149\u80fd\u6709\u4e0d\u540c\u7684\u76f8\u4f4d\u5ef6\u8fdf\u6765\u9020\u6210\u504f\u632f\u6001\u7684\u6539\u53d8\uff0c\u518d\u914d\u5408\u4e0a\u504f\u632f\u7247\u53ca\u68c0\u504f\u7247\u7684\u4f7f\u7528\u6765\u6539\u53d8\u5149\u6ce2\u7684\u632f\u5e45\u6216\u76f8\u4f4d\u3002\u8c03\u5236\u51fa\u5408\u9002\u7684\u5149\u8baf\u53f7\u9664\u4e86\u80fd\u9020\u6210\u5404\u79cd\u4e0d\u540c\u7269\u6ce2\u6765\u4ea7\u751f\u5f71\u50cf\u5916\uff0c\u8fd8\u80fd\u8ba9SLM\u6a21\u62df\u51fa\u5404\u79cd\u7b80\u5355\u7684\u6ce2\u5f62\uff0c\u5982\u7403\u9762\u6ce2\u3001\u5706\u67f1\u6ce2\u3001\u53ca\u5404\u79cd\u4e0d\u540c\u65b9\u5411\u4f20\u9012\u7684\u5e73\u9762\u6ce2\uff0c\u800c\u8fd9\u4e9b\u6ce2\u5f62\u4e00\u822c\u90fd\u662f\u7531\u900f\u955c\u3001\u5706\u67f1\u900f\u955c\u3001\u5e73\u9762\u955c\u6765\u4ea7\u751f\uff0c\u6240\u4ee5\u80fd\u5236\u9020\u51fa\u8fd9\u4e9b\u6ce2\u5f62\u4e5f\u4ee3\u8868\u7740SLM\u80fd\u5f53\u4f5c\u53ef\u8c03\u53d8\u7684\u5149\u5b66\u7ec4\u4ef6\u3002
desBeamShifting = No description available
desImportFormula = No description available